Австралия/src/Catalogs/ChartsOfAccounts/ChartsOfAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ChartsOfAccounts</name>
  <attributes>
    <name>TypeOfEntries</name>
    <type>
      <types>EnumRef.ChartsOfAccountsTypesOfEntries</types>
    </type>
  </attributes>
  <attributes>
    <name>ChartOfAccounts</name>
    <type>
      <types>EnumRef.ChartsOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>UseQuantity</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseAnalyticalDimensions</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AllowToChangeAnalyticalDimensionsIfAccountHasEntries</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AllowToChangeQuantitySettingsIfAccountHasEntries</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/ChartsOfAccounts/MasterChartOfAccounts/MasterChartOfAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>MasterChartOfAccounts</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ManagerialAnalyticalDimensionTypes</extDimensionTypes>
  <attributes>
    <name>ChartOfAccounts</name>
    <type>
      <types>CatalogRef.ChartsOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseQuantity</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseAnalyticalDimensions</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AnalyticalDimensionsSet</name>
    <type>
      <types>CatalogRef.AnalyticalDimensionsSets</types>
    </type>
  </attributes>
  <attributes>
    <name>IsAvailableForAllCompanies</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Companies</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>StartDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AnalyticalDimensions</name>
    <attributes>
      <name>AnalyticalDimension</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ManagerialAnalyticalDimensionTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <accountingFlags>
    <name>Currency</name>
    <comment>Currency</comment>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Quantity</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Currency</name>
    <comment>Currency</comment>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Quantity</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Австралия/src/Catalogs/ChartsOfAccounts/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

Function CheckExistAccountsWithAnalyticalDimensionsFlag(Val ChartOfAccounts) Export
	
	SetPrivilegedMode(True);
	
	Query = New Query;
	Query.Text = 
	"SELECT TOP 1
	|	MasterChartOfAccounts.Ref AS Ref
	|FROM
	|	ChartOfAccounts.MasterChartOfAccounts AS MasterChartOfAccounts
	|WHERE
	|	MasterChartOfAccounts.ChartOfAccounts = &ChartOfAccounts
	|	AND MasterChartOfAccounts.UseAnalyticalDimensions";
	
	Query.SetParameter("ChartOfAccounts", ChartOfAccounts);
	
	QueryResult = Query.Execute();
	
	SetPrivilegedMode(False);
	
	Return Not QueryResult.IsEmpty();

EndFunction

Function CheckExistAccountsWithQuantityFlag(Val ChartOfAccounts) Export
	
	SetPrivilegedMode(True);
	
	Query = New Query;
	Query.Text = 
	"SELECT TOP 1
	|	MasterChartOfAccounts.Ref AS Ref
	|FROM
	|	ChartOfAccounts.MasterChartOfAccounts AS MasterChartOfAccounts
	|WHERE
	|	MasterChartOfAccounts.ChartOfAccounts = &ChartOfAccounts
	|	AND MasterChartOfAccounts.UseQuantity";
	
	Query.SetParameter("ChartOfAccounts", ChartOfAccounts);
	
	QueryResult = Query.Execute();
	
	SetPrivilegedMode(False);
	
	Return Not QueryResult.IsEmpty();

EndFunction

#EndRegion

#Region EventHandlers

Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)

	NativeLanguagesSupportServer.ChoiceDataGetProcessing(
		ChoiceData,
		Parameters,
		StandardProcessing,
		Metadata.Catalogs.ChartsOfAccounts);

EndProcedure

Procedure PresentationGetProcessing(Data, Presentation, StandardProcessing)

	NationalLanguageSupportClientServer.PresentationGetProcessing(Data, Presentation, StandardProcessing);

EndProcedure

Procedure PresentationFieldsGetProcessing(Fields, StandardProcessing)

	NationalLanguageSupportClientServer.PresentationFieldsGetProcessing(Fields, StandardProcessing);

EndProcedure

#EndRegion

#EndIf
